{
  "basic_info": {
    "name": "Jacqueline Kennedy Onassis High School (02M529)",
    "school_id": "02M529",
    "google_maps_url": "https://www.google.com/maps/place/120+West+46+Street,+Manhattan,+NY+10036",
    "location": {
      "street_address": "120 West  46 Street",
      "city_state_zip": "Manhattan, NY 10036",
      "full_address": "120 West  46 Street, Manhattan, NY 10036"
    }
  },
  "survey_info": {
    "Families": "15% (41 surveys submitted)",
    "Teachers": "92% (22 surveys submitted)",
    "Students": "71% (193 surveys submitted)"
  },
  "metrics": {
    "Gen": {
      "School website": "JKOhighschool.org",
      "Principal": "Manuel Urena",
      "Grades served": "09,10,11,12,SE",
      "Enrollment": "292",
      "Average SAT": "885/1600",
      "Admissions methods": "Ed. Opt.",
      "State accountability status": "Local Support and Improvement"
    },
    "Location": {},
    "Directory-overview": {},
    "Sch-demog": {
      "Asian": "3%",
      "Black": "21%",
      "Hispanic or Latinx": "66%",
      "Native American": "1%",
      "Native Hawaiian/Pacific Islander": "<1%",
      "White": "7%",
      "English language learners": "14%",
      "Students with IEPs": "19%",
      "Economic Need Index": "87%",
      "Female": "62%",
      "Male": "38%",
      "Neither female nor male": "0%"
    },
    "Program": {
      "Boys": "Soccer,Volleyball,Indoor Track,Basketball,Handball,Baseball,Bowling,Outdoor Track,Table Tennis",
      "Girls": "Outdoor Track,Soccer,Flag Football,Volleyball,Indoor Track,Basketball,Softball",
      "Co-Ed": "Stunt"
    },
    "Staff": {
      "Asian": "24%",
      "Black": "N/A (fewer than 5 teachers)",
      "Hispanic or Latinx": "33%",
      "Native American": "0%",
      "Native Hawaiian/Pacific Islander": "0%",
      "White": "24%",
      "Years of experience as principal at this school": "5.1",
      "Teachers with 3 or more years of experience": "76%"
    },
    "Space": {
      "Shared space": "No"
    },
    "Survey-rr": {},
    "Ccr": {
      "Comparison Group*": "65%  Manhattan: 66% City: 64%",
      "(Number of students successfully completing out of 44 seniors)": ""
    },
    "Adv-demog": {},
    "Adv-footnote": {},
    "Lre": {},
    "Swiep": {},
    "Grad": {
      "Comparison Group*": "79%  Manhattan: 87% City: 88%"
    },
    "Prog-to-grad": {
      "Comparison Group*": "81%  Manhattan: 86% City: 84%"
    },
    "Learning-env": {
      "Manhattan": "77% City: 77%"
    },
    "Safety": {
      "Manhattan": "75% City: 74%"
    },
    "School-leadership": {
      "Manhattan": "81% City: 82%"
    },
    "Advising": {
      "Manhattan": "86% City: 86%"
    },
    "Attendance": {
      "Student attendance": "81% (Comp group*: 81%)",
      "Students with >90% attendance": "43% (Comp group*: 57%)",
      "Teacher attendance": "97%"
    },
    "Stu-support": {
      "Manhattan": "73% City: 73%"
    },
    "Communication": {
      "Manhattan": "91% City: 92%"
    },
    "Family-involve": {
      "Manhattan": "84% City: 83%"
    },
    "Relation-w-family": {
      "Manhattan": "93% City: 94%"
    },
    "School Values": {
      "Value 1": "51",
      "Value 2": "69%",
      "Value 3": "64%",
      "Value 4": "91%",
      "Value 5": "77%",
      "Value 6": "74%",
      "Value 7": "80%",
      "Value 8": "74%",
      "Value 9": "76%",
      "Value 10": "85%",
      "Value 11": "87%",
      "Value 12": "70%",
      "Value 13": "92%",
      "Value 14": "85%",
      "Value 15": "93%"
    }
  },
  "descriptions": [
    "",
    "Jacqueline Kennedy Onassis H.S. (JKO) is now a Magnet school that focuses on Science, Technology, Entrepreneurship, Art, & Math (S.T.E.A.M.) with a business focus. This Federal grant of almost 5 million dollars will enable us to enhance student learning experiences with the addition of STEAM electives, school project based learning, smaller class sizes, advanced technology equipment and tools, and after school enrichment opportunities; all part of the school's goal of providing students with a comprehensive set of experiences and opportunities to become college and career ready.  Located in midtown Manhattan, steps from the crossroads of the world (Times Square), JKO is a community where we envision our students graduating well prepared for both the business and educational communities. In addition to our award winning Entrepreneurship Virtual Enterprise and Hospitality and Tourism programs, we also offer a third rigorous academic program in economics and finance which includes courses such as AP Statistics, AP Macro Economics, and AP Micro Economics. Explore the world of business through the lens of economics as you prepare for the future. Understand how markets work in order to develop successful business strategies. JKO offers an array of business and math courses that provide an opportunity for work experience and post-secondary studies. Students explore a range of career paths, and gain meaningful experiences they can add to their resumes. Our students engage in a work based learning internship program during their senior year as a way to develop the skillsets necessary to thrive in the business world. Our Entrepreneurship Virtual Enterprise Program enables students to create and operate their own \"virtual\" company acting as CEOs and department managers. Our NAF Ac",
    "(Number of students in subgroup is in parentheses)",
    "What percentage of students say that this school offers a wide enough variety of programs, classes, and activities to keep them interested in school?",
    "After School Tutoring, Big Brothers/Big Sisters Work Place Mentoring Program, BSU, Coding Club, Creative Writing Club, Dance, Game Club, Helping Hands Society, LUCHA, Marsh and McLennan Mentoring Program, Morgan Stanley Mentoring Program, National Honor Society, Pickleball, Senior Council, Smash Arts Tech Team, Student Government, Journalism Club, Chess Club, Music Club, Fitness Club",
    "Studio Art, Fashion and Textile Design, Mixed Media, Visual Art",
    "Career & Technical Education; NYC Solves; Respect for All",
    "What percentage of students say that the school is kept clean?",
    "What percentage of teachers say that the school is kept in good physical condition?",
    "What percentage of teachers say that physical repairs to this school building are completed in a timely manner?",
    "The NYC School Survey is administered every year to students in grades 6-12 and to families and teachers of children in grades K-12. The survey is designed to collect information about each school's ability to support student success.",
    "Response rates show what percentage of the school community actually completed the survey. Higher response rates tell us that the results of the survey reflect the views of a larger portion of the group surveyed.",
    "is the average college and career readiness score for students at this school after four years in high school",
    "successfully completed approved college or career preparatory courses and exams",
    "graduated from high school and enrolled in college or other post-secondary program within six months",
    "How many students were enrolled in at least one advanced class?",
    "What is the racial breakdown of the students that were enrolled in at least one advanced class?",
    "(Number of students in subgroup is in parentheses)",
    "",
    "Movement of students with special needs to less restrictive environments",
    "What percentage of students with IEPs received their recommended special education programs?",
    "What percentage of students with IEPs received their recommended related services (such as counseling or speech, occupational or physical therapy)?",
    "of the class of 2024 graduated within four years",
    "(Number in parentheses shows all class-of-2024 students who are in the subgroup)",
    "of the class of 2022 graduated within six years",
    "The citywide graduation rates are projected numbers, subject to correction by the New York State Education Department.",
    "For the class of 2023, what was the graduation rate for seniors who entered the school with different eighth-grade test scores?",
    "earned enough credits in ninth grade to be on track for graduation",
    "earned enough credits in tenth grade to be on track for graduation",
    "How well does this school help students improve from their incoming proficiency levels and perform on Regents exams?",
    "English",
    "Algebra",
    "Social Studies",
    "Living Environment",
    "responded positively to survey questions about instruction/learning environment",
    "What percentage of students say that their teachers have high expectations for them?",
    "What percentage of students say that they learn a lot from feedback on their work?",
    "What percentage of students say that their teachers treat students of different races, cultures, or backgrounds equally?",
    "What percentage of teachers say that students in their class show that they respect each other's ideas?",
    "responded positively to survey questions about safety",
    "What percentage of students feel safe in the hallways, bathrooms, locker rooms, and cafeteria?",
    "responded positively to survey questions about school leadership",
    "What percentage of teachers say that the principal/school leader at this school sets high standards for student learning?",
    "What percentage of teachers say that the principal/school leader encourages feedback through regular meetings with families and teacher leaders?",
    "responded positively to survey questions about advising and planning",
    "What percentage of students say that adults at this school help them plan for how to meet their future career goals?",
    "responded positively to survey questions about student support",
    "What percentage of students say that their teachers support them when they are upset?",
    "What percentage of students say that their teachers treats them with respect?",
    "What percentage of students say that they feel like they belong at this school?",
    "responded positively to survey questions about communication",
    "What percentage of families say that the school staff regularly communicates with them about how they can help their child learn?",
    "responded positively to survey questions about family involvement",
    "What percentage of families say that they have communicated with their child's teacher about their child's performance?",
    "responded positively to survey questions about family-school trust",
    "What percentage of families say that the school staff work hard to build trusting relationships with families like them?"
  ]
}