{
  "basic_info": {
    "name": "The High School of Fashion Industries (02M600)",
    "school_id": "02M600",
    "google_maps_url": "https://www.google.com/maps/place/225+West+24+Street,+Manhattan,+NY+10011",
    "location": {
      "street_address": "225 West  24 Street",
      "city_state_zip": "Manhattan, NY 10011",
      "full_address": "225 West  24 Street, Manhattan, NY 10011"
    }
  },
  "survey_info": {
    "Families": "22% (320 surveys submitted)",
    "Teachers": "89% (103 surveys submitted)",
    "Students": "91% (1335 surveys submitted)"
  },
  "metrics": {
    "Gen": {
      "School website": "hsfi.nyc",
      "Principal": "Daryl Blank",
      "Grades served": "09,10,11,12,SE",
      "Enrollment": "1518",
      "Average SAT": "883/1600",
      "Admissions methods": "Audition, D75 Special Education Inclusive Services, Ed. Opt.",
      "State accountability status": "Local Support and Improvement"
    },
    "Location": {},
    "Directory-overview": {},
    "Sch-demog": {
      "Asian": "4%",
      "Black": "28%",
      "Hispanic or Latinx": "60%",
      "Native American": "<1%",
      "Native Hawaiian/Pacific Islander": "<1%",
      "White": "5%",
      "English language learners": "2%",
      "Students with IEPs": "18%",
      "Economic Need Index": "78%",
      "Female": "87%",
      "Male": "13%",
      "Neither female nor male": "<1%"
    },
    "Program": {
      "Boys": "Volleyball,Basketball,Badminton,Bowling",
      "Girls": "Swimming,Bowling,Outdoor Track,Wrestling,Indoor Track,Basketball,Volleyball,Soccer,Badminton,Cross Country,Softball",
      "Co-Ed": "Stunt",
      "Career & Technical Education; Career Readiness and Modern Youth Apprenticeship; CS for All; DYCD": "COMPASS/SONYC; Future Ready NYC; NYC Solves; Project Pivot"
    },
    "Staff": {
      "Asian": "10%",
      "Black": "11%",
      "Hispanic or Latinx": "14%",
      "Native American": "0%",
      "Native Hawaiian/Pacific Islander": "N/A (fewer than 5 teachers)",
      "White": "62%",
      "Years of experience as principal at this school": "14",
      "Teachers with 3 or more years of experience": "78%"
    },
    "Space": {
      "Shared space": "Yes, colocated (75M751)"
    },
    "Survey-rr": {},
    "Ccr": {
      "Comparison Group*": "70%  Manhattan: 66% City: 64%",
      "(Number of students successfully completing out of 374 seniors)": ""
    },
    "Adv-demog": {},
    "Adv-footnote": {},
    "Lre": {},
    "Swiep": {},
    "Grad": {
      "Comparison Group*": "95%  Manhattan: 87% City: 88%"
    },
    "Prog-to-grad": {
      "Comparison Group*": "88%  Manhattan: 86% City: 84%"
    },
    "Learning-env": {
      "Manhattan": "77% City: 77%"
    },
    "Safety": {
      "Manhattan": "75% City: 74%"
    },
    "School-leadership": {
      "Manhattan": "81% City: 82%"
    },
    "Advising": {
      "Manhattan": "86% City: 86%"
    },
    "Attendance": {
      "Student attendance": "89% (Comp group*: 85%)",
      "Students with >90% attendance": "62% (Comp group*: 60%)",
      "Teacher attendance": "96%"
    },
    "Stu-support": {
      "Manhattan": "73% City: 73%"
    },
    "Communication": {
      "Manhattan": "91% City: 92%"
    },
    "Family-involve": {
      "Manhattan": "84% City: 83%"
    },
    "Relation-w-family": {
      "Manhattan": "93% City: 94%"
    },
    "School Values": {
      "Value 1": "56",
      "Value 2": "89%",
      "Value 3": "70%",
      "Value 4": "95%",
      "Value 5": "93%",
      "Value 6": "89%",
      "Value 7": "92%",
      "Value 8": "81%",
      "Value 9": "77%",
      "Value 10": "84%",
      "Value 11": "90%",
      "Value 12": "77%",
      "Value 13": "94%",
      "Value 14": "82%",
      "Value 15": "95%"
    }
  },
  "descriptions": [
    "",
    "HSFI has it all-rigorous academic classes; cutting-edge programs in Fashion Design, Business, Software Design, Illustration, Graphics, and Photography; and a multi-million-dollar school-based health center where students receive free medical and dental care. HSFI excels at guiding students through the college application and financial aid process with College access classes given during the school day, a full-time College counselor, and current HSFI students and alumni trained as college counselors to support their peers. HSFI provides students hands-on experience with NYC companies in the fashion, business, and design worlds through our Corporate Advisory Board and industry partnerships. We are part of the Career Readiness and Modern Youth Apprenticeship pilot, which helps us support career readiness for all our students. We have courses that help our ninth and tenth graders explore their career interests and develop readiness skills. Our students can apply for apprenticeships in technology, finance, and business, which allows them to earn and learn while in high school. We are part of the Career Readiness and Modern Youth Apprenticeship (CRMYA) pilot, which helps us support career readiness for all our students. We have courses that help our ninth and tenth graders explore their career interests and develop readiness skills. Our students can apply for apprenticeships in tech, finance, and business, which allows them to earn and learn while in high school.",
    "(Number of students in subgroup is in parentheses)",
    "What percentage of students say that this school offers a wide enough variety of programs, classes, and activities to keep them interested in school?",
    "Iconoclan Hip Hop Dance Team, K-pop Dance Team, Latin Groove Dance Team, Photography, Sewing, Animal Welfare, Anime, Anti-Prom Fashion Show, Asian Culture, Black and Latina Empowerment, Black Student Union, Coding, Cooking-World Cuisine, Creative Writing, Crochet, Craft, Dungeons and Dragons, Emotions Matter, Feminist, Fashion Cares Community Service, Fashion With A Purpose, Financial Literacy, Gaming, Gardening,Gender Sexuality Alliance (GSA), Green Team, Guitar, Italian, Math, Modeling, Movie, Muslim Student Association, African American, Puerto Rican, and Latino Studies, National Honor Society, Patternmaking, Plant-Based Eating, Portfolio Development, RAPP-The Relationship Abuse Prevention Program Peer Leadership, RIF RAF Book Club, Rock Band & Song, Student Government, Sculpture, Skate Boarding Club, Sailing Club, Threads of Culture, and Watercolor Painting.",
    "Fashion and Textile Design, Computer Art / Digital Art, Portfolio Development, Drawing, Mixed Media, Photography, Painting, Graphic Design, Studio Art, Stage Design, and more",
    "What percentage of students say that the school is kept clean?",
    "What percentage of teachers say that the school is kept in good physical condition?",
    "What percentage of teachers say that physical repairs to this school building are completed in a timely manner?",
    "The NYC School Survey is administered every year to students in grades 6-12 and to families and teachers of children in grades K-12. The survey is designed to collect information about each school's ability to support student success.",
    "Response rates show what percentage of the school community actually completed the survey. Higher response rates tell us that the results of the survey reflect the views of a larger portion of the group surveyed.",
    "is the average college and career readiness score for students at this school after four years in high school",
    "successfully completed approved college or career preparatory courses and exams",
    "graduated from high school and enrolled in college or other post-secondary program within six months",
    "How many students were enrolled in at least one advanced class?",
    "What is the racial breakdown of the students that were enrolled in at least one advanced class?",
    "(Number of students in subgroup is in parentheses)",
    "",
    "Movement of students with special needs to less restrictive environments",
    "What percentage of students with IEPs received their recommended special education programs?",
    "What percentage of students with IEPs received their recommended related services (such as counseling or speech, occupational or physical therapy)?",
    "of the class of 2024 graduated within four years",
    "(Number in parentheses shows all class-of-2024 students who are in the subgroup)",
    "of the class of 2022 graduated within six years",
    "The citywide graduation rates are projected numbers, subject to correction by the New York State Education Department.",
    "For the class of 2023, what was the graduation rate for seniors who entered the school with different eighth-grade test scores?",
    "earned enough credits in ninth grade to be on track for graduation",
    "earned enough credits in tenth grade to be on track for graduation",
    "How well does this school help students improve from their incoming proficiency levels and perform on Regents exams?",
    "English",
    "Algebra",
    "Social Studies",
    "Living Environment",
    "responded positively to survey questions about instruction/learning environment",
    "What percentage of students say that their teachers have high expectations for them?",
    "What percentage of students say that they learn a lot from feedback on their work?",
    "What percentage of students say that their teachers treat students of different races, cultures, or backgrounds equally?",
    "What percentage of teachers say that students in their class show that they respect each other's ideas?",
    "responded positively to survey questions about safety",
    "What percentage of students feel safe in the hallways, bathrooms, locker rooms, and cafeteria?",
    "responded positively to survey questions about school leadership",
    "What percentage of teachers say that the principal/school leader at this school sets high standards for student learning?",
    "What percentage of teachers say that the principal/school leader encourages feedback through regular meetings with families and teacher leaders?",
    "responded positively to survey questions about advising and planning",
    "What percentage of students say that adults at this school help them plan for how to meet their future career goals?",
    "responded positively to survey questions about student support",
    "What percentage of students say that their teachers support them when they are upset?",
    "What percentage of students say that their teachers treats them with respect?",
    "What percentage of students say that they feel like they belong at this school?",
    "responded positively to survey questions about communication",
    "What percentage of families say that the school staff regularly communicates with them about how they can help their child learn?",
    "responded positively to survey questions about family involvement",
    "What percentage of families say that they have communicated with their child's teacher about their child's performance?",
    "responded positively to survey questions about family-school trust",
    "What percentage of families say that the school staff work hard to build trusting relationships with families like them?"
  ]
}