{
  "basic_info": {
    "name": "Isaac Newton Middle School for Math & Science (04M825)",
    "school_id": "04M825",
    "google_maps_url": "https://www.google.com/maps/place/260+Pleasant+Avenue,+Manhattan,+NY+10029",
    "location": {
      "street_address": "260 Pleasant Avenue",
      "city_state_zip": "Manhattan, NY 10029",
      "full_address": "260 Pleasant Avenue, Manhattan, NY 10029"
    }
  },
  "survey_info": {
    "Families": "24% (66 surveys submitted)",
    "Teachers": "97% (28 surveys submitted)",
    "Students": "91% (252 surveys submitted)"
  },
  "metrics": {
    "Gen": {
      "School website": "www.blackbinder.com",
      "Principal": "Florin Purice",
      "Grades served": "06,07,08,SE",
      "Enrollment": "291",
      "Admissions methods": "Open",
      "State accountability status": "Local Support and Improvement"
    },
    "Location": {},
    "Directory-overview": {
      "Isaac Newton Middle School for Math & Science": "A Rigorous Learning Environment with Holistic Development Isaac Newton Middle School for Math & Science fosters a rigorous academic environment designed to prepare students for success in high school and beyond. We cultivate a community where students are challenged to broaden their intellectual horizons and develop into well-informed, engaged citizens. Our curriculum emphasizes not only core academic and social skills but also technology integration. Students leverage technology to enhance their learning experience, showcase their knowledge, and develop responsible digital citizenship practices.  Enriching Educational Opportunities  Beyond core subjects, Isaac Newton Middle School offers a diverse range of electives, including chorus, theatre, visual arts, physical education, health, technology, foreign language, and tutorial classes. This comprehensive approach ensures a well-rounded educational experience that caters to various interests and talents.  Rigorous College Preparatory Program  In eighth grade, students embark on a rigorous college preparatory curriculum, tackling Regents-level coursework in Algebra I, Living Environment, and Global History. This prepares them for the academic demands of high school and fosters a strong foundation for future academic success.  Ideal Learning Environment  Located in the vibrant East Harlem community, our school boasts a picturesque setting close to the East River, shopping opportunities, and a skateboarding park. Classrooms are modern and well-equipped, featuring air conditioning, iPads, Apple TVs, and SmartBoards to enhance the learning experience. Jupiter Grades serves as our Learning Management System, facilitating communication and organization.  Commitment to Uniformity an"
    },
    "Sch-demog": {
      "Asian": "3%",
      "Black": "17%",
      "Hispanic or Latinx": "75%",
      "Native American": "1%",
      "Native Hawaiian/Pacific Islander": "0%",
      "White": "2%",
      "English language learners": "19%",
      "Students with IEPs": "26%",
      "Economic Need Index": ">95%",
      "Female": "45%",
      "Male": "55%",
      "Neither female nor male": "0%"
    },
    "Program": {
      "Boys": "N/A",
      "Girls": "N/A",
      "Co-Ed": "N/A"
    },
    "Staff": {
      "Asian": "21%",
      "Black": "N/A (fewer than 5 teachers)",
      "Hispanic or Latinx": "N/A (fewer than 5 teachers)",
      "Native American": "0%",
      "Native Hawaiian/Pacific Islander": "0%",
      "White": "54%",
      "Years of experience as principal at this school": "8.2",
      "Teachers with three or more years of experience": "61%"
    },
    "Space": {
      "Shared space": "Yes, colocated (04M435, 75M169)"
    },
    "Survey-rr": {},
    "Next-level": {
      "Comparison Group*": "88% District 04: 87%  City: 91%"
    },
    "Core-course": {
      "Comparison Group*": "98% District 04: 94%  City: 95%"
    },
    "Lre": {},
    "Swiep": {},
    "Ells": {},
    "Learning-env": {
      "District 04": "77%  City: 77%"
    },
    "Perf": {
      "Comparison Group*": "45% District 04: 46%  City: 51%"
    },
    "Growth": {},
    "Perf2": {
      "Comparison Group*": "45% District 04: 41%  City: 51%"
    },
    "Growth2": {},
    "Safety": {
      "District 04": "65%  City: 63%"
    },
    "School-leadership": {
      "District 04": "87%  City: 84%"
    },
    "Advising": {
      "District 04": "86%  City: 89%"
    },
    "Attendance": {
      "Student attendance": "88% (Comp group*: 100%)",
      "Students with >90% attendance": "53% (Comp group*: 77%)",
      "Teacher attendance": "98%"
    },
    "Stu-support": {
      "District 04": "70%  City: 71%"
    },
    "Communication": {
      "District 04": "94%  City: 94%"
    },
    "Family-involve": {
      "District 04": "86%  City: 87%"
    },
    "Relation-w-family": {
      "District 04": "94%  City: 94%"
    },
    "School Values": {
      "Value 1": "88%",
      "Value 2": "68%",
      "Value 3": "98%",
      "Value 4": "74%",
      "Value 5": "37%",
      "Value 6": "34%",
      "Value 7": "65%",
      "Value 8": "86%",
      "Value 9": "90%",
      "Value 10": "70%",
      "Value 11": "98%",
      "Value 12": "89%",
      "Value 13": "98%"
    }
  },
  "descriptions": [
    "",
    "(Number of students in subgroup is in parentheses)",
    "What percentage of students say that this school offers a wide enough variety of programs, classes, and activities to keep them interested in school?",
    "Art, Chorus, Drama, Lego Robotics, Music, Musical Theater, Theater",
    "Community School",
    "What percentage of students say that the school is kept clean?",
    "What percentage of teachers say that the school is kept in good physical condition?",
    "What percentage of teachers say that physical repairs to this school building are completed in a timely manner?",
    "The NYC School Survey is administered every year to students in grades 6-12 and to families and teachers of children in grades K-12. The survey is designed to collect information about each school's ability to support student success.",
    "Response rates show what percentage of the school community actually completed the survey. Higher response rates tell us that the results of the survey reflect the views of a larger portion of the group surveyed.",
    "of this school's former eighth graders earned enough high school credit in ninth grade to be on track for graduation",
    "Which high schools did students from this school most frequently attend?",
    "of eighth grade students earned high school credit",
    "pass rate by this school's students in their math, English, social studies, and science classes",
    "Movement of students with special needs to less restrictive environments",
    "What percentage of students with IEPs received their recommended special education programs?",
    "What percentage of students with IEPs received their recommended related services (such as counseling or speech, occupational or physical therapy)?",
    "How well does this school help English language learners demonstrate movement toward English language proficiency?",
    "responded positively to survey questions about instruction/learning environment",
    "What percentage of students say that their teachers have high expectations for them?",
    "What percentage of students say that they learn a lot from feedback on their work?",
    "What percentage of students say that their teachers treat students of different races, cultures, or backgrounds equally?",
    "What percentage of teachers say that students in their class show that they respect each other's ideas?",
    "of students at this school met State standards on the State English test; the average score was 2.7 out of 4.5",
    "What percentage of different groups of students met State standards (scored a 3 or 4) on the State English test?",
    "(Total number of test takers in the subgroup is in parentheses)",
    "How well did this school help students improve on their State English tests?",
    "Over the past two years, how did each eighth grade students' State test scores compare to their own scores from when they were in fifth grade?",
    "of students at this school met State standards on the State math test; the average score was 2.7 out of 4.5",
    "What percentage of different groups of students met State standards (scored a 3 or 4) on the State math test?",
    "(Total number of test takers in the subgroup is in parentheses)",
    "How well did this school help students improve on their State math tests?",
    "Over the past two years, how did each eighth grade students' State test scores compare to their own scores from when they were in fifth grade?",
    "responded positively to survey questions about safety",
    "What percentage of students feel safe in the hallways, bathrooms, locker rooms, and cafeteria?",
    "responded positively to survey questions about school leadership",
    "What percentage of teachers say that the principal/school leader at this school sets high standards for student learning?",
    "What percentage of teachers say that the principal/school leader encourages feedback through regular meetings with families and teacher leaders?",
    "responded positively to survey questions about advising and planning",
    "What percentage of students say that this school provides them with guidance on the high school application process?",
    "responded positively to survey questions about student support",
    "What percentage of students say that their teachers support them when they are upset?",
    "What percentage of students say that their teachers treats them with respect?",
    "What percentage of students say that they feel like they belong at this school?",
    "responded positively to survey questions about communication",
    "What percentage of families say that the school staff regularly communicates with them about how they can help their child learn?",
    "responded positively to survey questions about family involvement",
    "What percentage of families say that they have communicated with their child's teacher about their child's performance?",
    "responded positively to survey questions about family-school trust",
    "What percentage of families say that the school staff work hard to build trusting relationships with families like them?"
  ]
}